wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_flexcan.h
/***********************************************************************************************************************
    @file     reg_flexcan.h
    @author   VV TEAM
    @brief    This flie contains all the FLEXCAN's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_FLEXCAN_H
#define __REG_FLEXCAN_H

/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "core_starmc1.h"

/**
  * @brief FLEXCAN Base Address Definition
  */
#define  FLEXCAN1_BASE                             0x4000C000 /*!<Base Address: 0x4000C000*/
#define  FLEXCAN2_BASE                             0x40018000 /*!<Base Address: 0x40018000*/

/**
  * @brief FLEXCAN Register Structure Definition
  */
typedef struct
{
    __IO uint32_t MCR;                            /*!<FLEXCAN Module Configuration Register          offset: 0x00       */
    __IO uint32_t CTRL1;                          /*!<FLEXCAN Control Register 1                     offset: 0x04       */
    __IO uint32_t TIMER;                          /*!<FLEXCAN Free Running Timer Register            offset: 0x08       */
    __IO uint32_t RESERVED0x0C[1];                /*!<                                               offset: 0x0C       */
    __IO uint32_t RXMGMASK;                       /*!<FLEXCAN Rx Mailboxes Global Mask Register      offset: 0x10       */
    __IO uint32_t RX14MASK;                       /*!<FLEXCAN Rx 14 Mask Registe                     offset: 0x14       */
    __IO uint32_t RX15MASK;                       /*!<FLEXCAN Rx 15 Mask Register                    offset: 0x18       */
    __IO uint32_t ECR;                            /*!<FLEXCAN Error Counter Register                 offset: 0x1C       */
    __IO uint32_t ESR1;                           /*!<FLEXCAN Error and Status Register 1            offset: 0x20       */
    __IO uint32_t RESERVED0x24[1];                /*!<                                               offset: 0x24       */
    __IO uint32_t IMASK1;                         /*!<FLEXCAN Interrupt Mask Register 1              offset: 0x28       */
    __IO uint32_t RESERVED0x2C[1];                /*!<                                               offset: 0x2C       */
    __IO uint32_t IFLAG1;                         /*!<FLEXCAN Interrupt Flag Register 1              offset: 0x30       */
    __IO uint32_t CTRL2;                          /*!<FLEXCAN Control Register 2                     offset: 0x34       */
    __IO uint32_t ESR2;                           /*!<FLEXCAN Error and Status Register 2            offset: 0x38       */
    __IO uint32_t RESERVED0x3C[2];                /*!<                                               offset: 0x3C~0x40  */
    __IO uint32_t CRCR;                           /*!<FLEXCAN CRC Register                           offset: 0x44       */
    __IO uint32_t RXFGMASK;                       /*!<FLEXCAN Rx FIFO Global Mask Register           offset: 0x48       */
    __IO uint32_t RXFIR;                          /*!<FLEXCAN Rx FIFO Information Register           offset: 0x4C       */
    __IO uint32_t CBT;                            /*!<FLEXCAN CAN Bit Timing Register                offset: 0x50       */
    __IO uint32_t RESERVED_4[11];

    struct                                        /*!< offset: 0x80 array step: 0x10 x 128bit */
    {
        __IO uint32_t CS;                         /*!< Message Buffer 0 CS Register..Message Buffer 31 CS Register, array offset: 0x80, array step: 0x10 */
        __IO uint32_t ID;                         /*!< Message Buffer 0 ID Register..Message Buffer 31 ID Register, array offset: 0x84, array step: 0x10 */
        __IO uint32_t WORD0;                      /*!< Message Buffer 0 WORD0 Register..Message Buffer 31 WORD0 Register, array offset: 0x88, array step: 0x10 */
        __IO uint32_t WORD1;                      /*!< Message Buffer 0 WORD1 Register..Message Buffer 31 WORD1 Register, array offset: 0x8C, array step: 0x10 */
    }MB[16];

    __IO uint32_t RESERVED_5[448];
    __IO uint32_t RXIMR[32];                      /*!<FLEXCAN Rx Individual Mask Registers           offset: 0x880      */
    __IO uint32_t RESERVED0x900[192];             /*!<                                               offset: 0x900~0xBFC*/
    __IO uint32_t FDCTRL;                         /*!<FLEXCAN CAN FD Control Register                offset: 0xC00      */
    __IO uint32_t FDCBT;                          /*!<FLEXCAN CAN FD Bit Timing Register             offset: 0xC04      */
    __IO uint32_t FDCRC;                          /*!<FLEXCAN CAN FD CRC Register                    offset: 0xC08      */
    __IO uint32_t ERFCR;                          /*!<FLEXCAN Enhanced Rx FIFO Control Register      offset: 0xC0C      */
    __IO uint32_t ERFIER;                         /*!<FLEXCAN Enhanced Rx FIFO Interrupt Enable      offset: 0xC10
                                                      Register                                                          */
    __IO uint32_t ERFSR;                          /*!<FLEXCAN Enhanced Rx FIFO Status Register       offset: 0xC14      */
    __IO uint32_t RESERVED0xC18[1274];            /*!<                                               offset: 0xC18~0x1FFC */
    struct
    {
        __IO uint32_t ERFCS;                            /*!< Enhanced Rx FIFO Buffer 0 CS Register                offset: 0x2000 */
        __IO uint32_t ERFDID;                           /*!< Enhanced Rx FIFO Buffer 0 ID Register                offset: 0x2004 */
        __IO uint32_t ERFDWORD[16];                     /*!< Enhanced Rx FIFO Buffer 0 WORD Register              offset: 0x2008 */
        __IO uint32_t IHOFF;                            /*!< Identifier receive filter hit indication             offset: 0x2048 */
        __IO uint32_t RESERVED0x204C[1];                /*!<                                                      offset: 0x204C */
    }ERFMB[6];                                          /*!<                                                      offset: 0x2000~0x21DC */
    __IO uint32_t RESERVED0x21E0[904];                  /*!<                                                      offset: 0x21E0~0x2FFC */
    __IO uint32_t ERFFEL[2];                      /*!<FLEXCAN Enhanced Rx FIFO Filter Element        offset: 0x3000
                                                      Registers                                                         */
} FLEXCAN_TypeDef;

/**
  * @brief FLEXCAN type pointer Definition
  */
#define FLEXCAN1                                   ((FLEXCAN_TypeDef *)FLEXCAN1_BASE)
#define FLEXCAN2                                   ((FLEXCAN_TypeDef *)FLEXCAN2_BASE)

/**
  * @brief FLEXCAN_MCR Register Bit Definition
  */
#define  FLEXCAN_MCR_MAXMB_Pos                    (0)
#define  FLEXCAN_MCR_MAXMB_Msk                    (0x7FU << FLEXCAN_MCR_MAXMB_Pos)                  /*!<The number of the last MB that will take part in the matching and arbitration processes*/
#define  FLEXCAN_MCR_MAXMB                        FLEXCAN_MCR_MAXMB_Msk
#define  FLEXCAN_MCR_MAXMB_0                      (0x01U << FLEXCAN_MCR_MAXMB_Pos)
#define  FLEXCAN_MCR_MAXMB_1                      (0x02U << FLEXCAN_MCR_MAXMB_Pos)
#define  FLEXCAN_MCR_MAXMB_2                      (0x04U << FLEXCAN_MCR_MAXMB_Pos)
#define  FLEXCAN_MCR_MAXMB_3                      (0x08U << FLEXCAN_MCR_MAXMB_Pos)
#define  FLEXCAN_MCR_MAXMB_4                      (0x10U << FLEXCAN_MCR_MAXMB_Pos)
#define  FLEXCAN_MCR_MAXMB_5                      (0x20U << FLEXCAN_MCR_MAXMB_Pos)
#define  FLEXCAN_MCR_MAXMB_6                      (0x40U << FLEXCAN_MCR_MAXMB_Pos)
#define  FLEXCAN_MCR_IDAM_Pos                     (8)
#define  FLEXCAN_MCR_IDAM_Msk                     (0x3U << FLEXCAN_MCR_IDAM_Pos)                    /*!<The format of the Rx FIFO ID Filter Table elements*/
#define  FLEXCAN_MCR_IDAM                         FLEXCAN_MCR_IDAM_Msk
#define  FLEXCAN_MCR_IDAM_0                       (0x1U << FLEXCAN_MCR_IDAM_Pos)
#define  FLEXCAN_MCR_IDAM_1                       (0x2U << FLEXCAN_MCR_IDAM_Pos)
#define  FLEXCAN_MCR_FDEN_Pos                     (11)
#define  FLEXCAN_MCR_FDEN_Msk                     (0x1U << FLEXCAN_MCR_FDEN_Pos)                    /*!<*/
#define  FLEXCAN_MCR_FDEN                         FLEXCAN_MCR_FDEN_Msk
#define  FLEXCAN_MCR_AEN_Pos                      (12)
#define  FLEXCAN_MCR_AEN_Msk                      (0x1U << FLEXCAN_MCR_AEN_Pos)                     /*!<1: Enable abort*/
#define  FLEXCAN_MCR_AEN                          FLEXCAN_MCR_AEN_Msk
#define  FLEXCAN_MCR_LPRIOEN_Pos                  (13)
#define  FLEXCAN_MCR_LPRIOEN_Msk                  (0x1U << FLEXCAN_MCR_LPRIOEN_Pos)                 /*!<1: Enable Local Priority*/
#define  FLEXCAN_MCR_LPRIOEN                      FLEXCAN_MCR_LPRIOEN_Msk
#define  FLEXCAN_MCR_DMA_Pos                      (15)
#define  FLEXCAN_MCR_DMA_Msk                      (0x1U << FLEXCAN_MCR_DMA_Pos)                     /*!<1: Enable DMA feature for Rx FIFO*/
#define  FLEXCAN_MCR_DMA                          FLEXCAN_MCR_DMA_Msk
#define  FLEXCAN_MCR_IRMQ_Pos                     (16)
#define  FLEXCAN_MCR_IRMQ_Msk                     (0x1U << FLEXCAN_MCR_IRMQ_Pos)                    /*!<1: Enable individual Rx masking and queue feature*/
#define  FLEXCAN_MCR_IRMQ                         FLEXCAN_MCR_IRMQ_Msk
#define  FLEXCAN_MCR_SRXDIS_Pos                   (17)
#define  FLEXCAN_MCR_SRXDIS_Msk                   (0x1U << FLEXCAN_MCR_SRXDIS_Pos)                  /*!<1: Disable self reception*/
#define  FLEXCAN_MCR_SRXDIS                       FLEXCAN_MCR_SRXDIS_Msk
#define  FLEXCAN_MCR_LPMACK_Pos                   (20)
#define  FLEXCAN_MCR_LPMACK_Msk                   (0x1U << FLEXCAN_MCR_LPMACK_Pos)                  /*!<Low-Power Mode Acknowledge*/
#define  FLEXCAN_MCR_LPMACK                       FLEXCAN_MCR_LPMACK_Msk
#define  FLEXCAN_MCR_WRNEN_Pos                    (21)
#define  FLEXCAN_MCR_WRNEN_Msk                    (0x1U << FLEXCAN_MCR_WRNEN_Pos)                   /*!<Warning Interrupt Enable*/
#define  FLEXCAN_MCR_WRNEN                        FLEXCAN_MCR_WRNEN_Msk
#define  FLEXCAN_MCR_SUPV_Pos                     (23)
#define  FLEXCAN_MCR_SUPV_Msk                     (0x1U << FLEXCAN_MCR_SUPV_Pos)                    /*!<1: FlexCAN is in Supervisor mode. Affected registers allow only Supervisor access.*/
#define  FLEXCAN_MCR_SUPV                         FLEXCAN_MCR_SUPV_Msk
#define  FLEXCAN_MCR_FRZACK_Pos                   (24)
#define  FLEXCAN_MCR_FRZACK_Msk                   (0x1U << FLEXCAN_MCR_FRZACK_Pos)                  /*!<Freeze Mode Acknowledge*/
#define  FLEXCAN_MCR_FRZACK                       FLEXCAN_MCR_FRZACK_Msk
#define  FLEXCAN_MCR_SOFTRST_Pos                  (25)
#define  FLEXCAN_MCR_SOFTRST_Msk                  (0x1U << FLEXCAN_MCR_SOFTRST_Pos)                 /*!<Soft reset*/
#define  FLEXCAN_MCR_SOFTRST                      FLEXCAN_MCR_SOFTRST_Msk
#define  FLEXCAN_MCR_WAKMSK_Pos                   (26)
#define  FLEXCAN_MCR_WAKMSK_Msk                   (0x1U << FLEXCAN_MCR_WAKMSK_Pos)                  /*!<1: FlexCAN is either in Disable or Freeze mode*/
#define  FLEXCAN_MCR_WAKMSK                       FLEXCAN_MCR_WAKMSK_Msk
#define  FLEXCAN_MCR_NOTRDY_Pos                   (27)
#define  FLEXCAN_MCR_NOTRDY_Msk                   (0x1U << FLEXCAN_MCR_NOTRDY_Pos)                  /*!<1: FlexCAN is either in Disable or Freeze mode*/
#define  FLEXCAN_MCR_NOTRDY                       FLEXCAN_MCR_NOTRDY_Msk
#define  FLEXCAN_MCR_HALT_Pos                     (28)
#define  FLEXCAN_MCR_HALT_Msk                     (0x1U << FLEXCAN_MCR_HALT_Pos)                    /*!<1: Enter Freeze mode if the FRZ bit is asserted*/
#define  FLEXCAN_MCR_HALT                         FLEXCAN_MCR_HALT_Msk
#define  FLEXCAN_MCR_RFEN_Pos                     (29)
#define  FLEXCAN_MCR_RFEN_Msk                     (0x1U << FLEXCAN_MCR_RFEN_Pos)                    /*!<1: Enable Rx FIFO*/
#define  FLEXCAN_MCR_RFEN                         FLEXCAN_MCR_RFEN_Msk
#define  FLEXCAN_MCR_FRZ_Pos                      (30)
#define  FLEXCAN_MCR_FRZ_Msk                      (0x1U << FLEXCAN_MCR_FRZ_Pos)                     /*!<1: Enabled to enter Freeze mode*/
#define  FLEXCAN_MCR_FRZ                          FLEXCAN_MCR_FRZ_Msk
#define  FLEXCAN_MCR_MDIS_Pos                     (31)
#define  FLEXCAN_MCR_MDIS_Msk                     (0x1U << FLEXCAN_MCR_MDIS_Pos)                    /*!<1: Disable the FlexCAN module as well as the clocks to the PE and CHI submodules*/
#define  FLEXCAN_MCR_MDIS                         FLEXCAN_MCR_MDIS_Msk

/**
  * @brief FLEXCAN_CTRL1 Register Bit Definition
  */
#define  FLEXCAN_CTRL1_PROPSEG_Pos                (0)
#define  FLEXCAN_CTRL1_PROPSEG_Msk                (0x7U << FLEXCAN_CTRL1_PROPSEG_Pos)               /*!<Propagation Segment �� Defines the length of the Propagation Segment in the bit time*/
#define  FLEXCAN_CTRL1_PROPSEG                    FLEXCAN_CTRL1_PROPSEG_Msk
#define  FLEXCAN_CTRL1_PROPSEG_0                  (0x1U << FLEXCAN_CTRL1_PROPSEG_Pos)
#define  FLEXCAN_CTRL1_PROPSEG_1                  (0x2U << FLEXCAN_CTRL1_PROPSEG_Pos)
#define  FLEXCAN_CTRL1_PROPSEG_2                  (0x4U << FLEXCAN_CTRL1_PROPSEG_Pos)
#define  FLEXCAN_CTRL1_LOM_Pos                    (3)
#define  FLEXCAN_CTRL1_LOM_Msk                    (0x1U << FLEXCAN_CTRL1_LOM_Pos)                   /*!<Configures the FlexCAN to operate in Listen-Only mode*/
#define  FLEXCAN_CTRL1_LOM                        FLEXCAN_CTRL1_LOM_Msk
#define  FLEXCAN_CTRL1_LBUF_Pos                   (4)
#define  FLEXCAN_CTRL1_LBUF_Msk                   (0x1U << FLEXCAN_CTRL1_LBUF_Pos)                  /*!<The ordering mechanism for message buffer transmission*/
#define  FLEXCAN_CTRL1_LBUF                       FLEXCAN_CTRL1_LBUF_Msk
#define  FLEXCAN_CTRL1_TSYN_Pos                   (5)
#define  FLEXCAN_CTRL1_TSYN_Msk                   (0x1U << FLEXCAN_CTRL1_TSYN_Pos)                  /*!<Timer Sync �� a mechanism that resets the free-running timer each time a message is received in MB0*/
#define  FLEXCAN_CTRL1_TSYN                       FLEXCAN_CTRL1_TSYN_Msk
#define  FLEXCAN_CTRL1_BOFFREC_Pos                (6)
#define  FLEXCAN_CTRL1_BOFFREC_Msk                (0x1U << FLEXCAN_CTRL1_BOFFREC_Pos)               /*!<Defines how the FlexCAN recovers from Bus Off state*/
#define  FLEXCAN_CTRL1_BOFFREC                    FLEXCAN_CTRL1_BOFFREC_Msk
#define  FLEXCAN_CTRL1_SMP_Pos                    (7)
#define  FLEXCAN_CTRL1_SMP_Msk                    (0x1U << FLEXCAN_CTRL1_SMP_Pos)                   /*!<The sampling mode of CAN bits at the Rx input*/
#define  FLEXCAN_CTRL1_SMP                        FLEXCAN_CTRL1_SMP_Msk
#define  FLEXCAN_CTRL1_RWRNMSK_Pos                (10)
#define  FLEXCAN_CTRL1_RWRNMSK_Msk                (0x1U << FLEXCAN_CTRL1_RWRNMSK_Pos)               /*!<Rx Warning Interrupt (CAN_ESR1.RWRNINT) Mask*/
#define  FLEXCAN_CTRL1_RWRNMSK                    FLEXCAN_CTRL1_RWRNMSK_Msk
#define  FLEXCAN_CTRL1_TWRNMSK_Pos                (11)
#define  FLEXCAN_CTRL1_TWRNMSK_Msk                (0x1U << FLEXCAN_CTRL1_TWRNMSK_Pos)               /*!<Tx Warning Interrupt (CAN_ESR1.TWRNINT) Mask*/
#define  FLEXCAN_CTRL1_TWRNMSK                    FLEXCAN_CTRL1_TWRNMSK_Msk
#define  FLEXCAN_CTRL1_LPB_Pos                    (12)
#define  FLEXCAN_CTRL1_LPB_Msk                    (0x1U << FLEXCAN_CTRL1_LPB_Pos)                   /*!<1: Loop-Back enabled*/
#define  FLEXCAN_CTRL1_LPB                        FLEXCAN_CTRL1_LPB_Msk
#define  FLEXCAN_CTRL1_CLKSRC_Pos                 (13)
#define  FLEXCAN_CTRL1_CLKSRC_Msk                 (0x1U << FLEXCAN_CTRL1_CLKSRC_Pos)                /*!<Selects the clock source*/
#define  FLEXCAN_CTRL1_CLKSRC                     FLEXCAN_CTRL1_CLKSRC_Msk
#define  FLEXCAN_CTRL1_ERRMSK_Pos                 (14)
#define  FLEXCAN_CTRL1_ERRMSK_Msk                 (0x1U << FLEXCAN_CTRL1_ERRMSK_Pos)                /*!<Error Interrupt (CAN_ESR1.ERRINT) Mask*/
#define  FLEXCAN_CTRL1_ERRMSK                     FLEXCAN_CTRL1_ERRMSK_Msk
#define  FLEXCAN_CTRL1_BOFFMSK_Pos                (15)
#define  FLEXCAN_CTRL1_BOFFMSK_Msk                (0x1U << FLEXCAN_CTRL1_BOFFMSK_Pos)               /*!<Bus Off Interrupt (CAN_ESR1.BOFFINT) Mask*/
#define  FLEXCAN_CTRL1_BOFFMSK                    FLEXCAN_CTRL1_BOFFMSK_Msk
#define  FLEXCAN_CTRL1_PSEG2_Pos                  (16)
#define  FLEXCAN_CTRL1_PSEG2_Msk                  (0x7U << FLEXCAN_CTRL1_PSEG2_Pos)                 /*!<Phase Segment 2 �� Defines the length of Phase Segment 2 in the bit time*/
#define  FLEXCAN_CTRL1_PSEG2                      FLEXCAN_CTRL1_PSEG2_Msk
#define  FLEXCAN_CTRL1_PSEG2_0                    (0x1U << FLEXCAN_CTRL1_PSEG2_Pos)
#define  FLEXCAN_CTRL1_PSEG2_1                    (0x2U << FLEXCAN_CTRL1_PSEG2_Pos)
#define  FLEXCAN_CTRL1_PSEG2_2                    (0x4U << FLEXCAN_CTRL1_PSEG2_Pos)
#define  FLEXCAN_CTRL1_PSEG1_Pos                  (19)
#define  FLEXCAN_CTRL1_PSEG1_Msk                  (0x7U << FLEXCAN_CTRL1_PSEG1_Pos)                 /*!<Phase Segment 1 �� Defines the length of Phase Segment 1 in the bit time*/
#define  FLEXCAN_CTRL1_PSEG1                      FLEXCAN_CTRL1_PSEG1_Msk
#define  FLEXCAN_CTRL1_PSEG1_0                    (0x1U << FLEXCAN_CTRL1_PSEG1_Pos)
#define  FLEXCAN_CTRL1_PSEG1_1                    (0x2U << FLEXCAN_CTRL1_PSEG1_Pos)
#define  FLEXCAN_CTRL1_PSEG1_2                    (0x4U << FLEXCAN_CTRL1_PSEG1_Pos)
#define  FLEXCAN_CTRL1_RJW_Pos                    (22)
#define  FLEXCAN_CTRL1_RJW_Msk                    (0x3U << FLEXCAN_CTRL1_RJW_Pos)                   /*!<Resync Jump Width �� Defines the maximum number of Tq that a bit time can be changed by one re-synchronization*/
#define  FLEXCAN_CTRL1_RJW                        FLEXCAN_CTRL1_RJW_Msk
#define  FLEXCAN_CTRL1_RJW_0                      (0x1U << FLEXCAN_CTRL1_RJW_Pos)
#define  FLEXCAN_CTRL1_RJW_1                      (0x2U << FLEXCAN_CTRL1_RJW_Pos)
#define  FLEXCAN_CTRL1_PRESDIV_Pos                (24)
#define  FLEXCAN_CTRL1_PRESDIV_Msk                (0xFFU << FLEXCAN_CTRL1_PRESDIV_Pos)              /*!<Prescaler Division Factor �� Defines the ratio between the PE clock frequency and the Serial Clock (Sclock) frequency*/
#define  FLEXCAN_CTRL1_PRESDIV                    FLEXCAN_CTRL1_PRESDIV_Msk
#define  FLEXCAN_CTRL1_PRESDIV_0                  (0x01U << FLEXCAN_CTRL1_PRESDIV_Pos)
#define  FLEXCAN_CTRL1_PRESDIV_1                  (0x02U << FLEXCAN_CTRL1_PRESDIV_Pos)
#define  FLEXCAN_CTRL1_PRESDIV_2                  (0x04U << FLEXCAN_CTRL1_PRESDIV_Pos)
#define  FLEXCAN_CTRL1_PRESDIV_3                  (0x08U << FLEXCAN_CTRL1_PRESDIV_Pos)
#define  FLEXCAN_CTRL1_PRESDIV_4                  (0x10U << FLEXCAN_CTRL1_PRESDIV_Pos)
#define  FLEXCAN_CTRL1_PRESDIV_5                  (0x20U << FLEXCAN_CTRL1_PRESDIV_Pos)
#define  FLEXCAN_CTRL1_PRESDIV_6                  (0x40U << FLEXCAN_CTRL1_PRESDIV_Pos)
#define  FLEXCAN_CTRL1_PRESDIV_7                  (0x80U << FLEXCAN_CTRL1_PRESDIV_Pos)

/**
  * @brief FLEXCAN_TIMER Register Bit Definition
  */
#define  FLEXCAN_TIMER_TIMER_Pos                  (0)
#define  FLEXCAN_TIMER_TIMER_Msk                  (0xFFFFU << FLEXCAN_TIMER_TIMER_Pos)              /*!<Timer Value: Contains the free-running counter value.*/
#define  FLEXCAN_TIMER_TIMER                      FLEXCAN_TIMER_TIMER_Msk
#define  FLEXCAN_TIMER_TIMER_0                    (0x0001U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_1                    (0x0002U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_2                    (0x0004U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_3                    (0x0008U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_4                    (0x0010U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_5                    (0x0020U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_6                    (0x0040U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_7                    (0x0080U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_8                    (0x0100U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_9                    (0x0200U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_10                   (0x0400U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_11                   (0x0800U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_12                   (0x1000U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_13                   (0x2000U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_14                   (0x4000U << FLEXCAN_TIMER_TIMER_Pos)
#define  FLEXCAN_TIMER_TIMER_15                   (0x8000U << FLEXCAN_TIMER_TIMER_Pos)

