wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_flexcan.h
/**
  * @brief FLEXCAN_RXMGMASK Register Bit Definition
  */
#define  FLEXCAN_RXMGMASK_MG_Pos                  (0)
#define  FLEXCAN_RXMGMASK_MG_Msk                  (0xFFFFFFFFU << FLEXCAN_RXMGMASK_MG_Pos)          /*!<Rx Mailboxes Global Mask Bits*/
#define  FLEXCAN_RXMGMASK_MG                      FLEXCAN_RXMGMASK_MG_Msk
#define  FLEXCAN_RXMGMASK_MG_0                    (0x00000001U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_1                    (0x00000002U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_2                    (0x00000004U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_3                    (0x00000008U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_4                    (0x00000010U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_5                    (0x00000020U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_6                    (0x00000040U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_7                    (0x00000080U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_8                    (0x00000100U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_9                    (0x00000200U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_10                   (0x00000400U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_11                   (0x00000800U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_12                   (0x00001000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_13                   (0x00002000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_14                   (0x00004000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_15                   (0x00008000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_16                   (0x00010000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_17                   (0x00020000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_18                   (0x00040000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_19                   (0x00080000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_20                   (0x00100000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_21                   (0x00200000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_22                   (0x00400000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_23                   (0x00800000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_24                   (0x01000000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_25                   (0x02000000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_26                   (0x04000000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_27                   (0x08000000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_28                   (0x10000000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_29                   (0x20000000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_30                   (0x40000000U << FLEXCAN_RXMGMASK_MG_Pos)
#define  FLEXCAN_RXMGMASK_MG_31                   (0x80000000U << FLEXCAN_RXMGMASK_MG_Pos)

/**
  * @brief FLEXCAN_RX14MASK Register Bit Definition
  */
#define  FLEXCAN_RX14MASK_RX14M_Pos               (0)
#define  FLEXCAN_RX14MASK_RX14M_Msk               (0xFFFFFFFFU << FLEXCAN_RX14MASK_RX14M_Pos)       /*!<Rx MB14 Mask Bits*/
#define  FLEXCAN_RX14MASK_RX14M                   FLEXCAN_RX14MASK_RX14M_Msk
#define  FLEXCAN_RX14MASK_RX14M_0                 (0x00000001U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_1                 (0x00000002U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_2                 (0x00000004U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_3                 (0x00000008U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_4                 (0x00000010U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_5                 (0x00000020U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_6                 (0x00000040U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_7                 (0x00000080U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_8                 (0x00000100U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_9                 (0x00000200U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_10                (0x00000400U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_11                (0x00000800U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_12                (0x00001000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_13                (0x00002000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_14                (0x00004000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_15                (0x00008000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_16                (0x00010000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_17                (0x00020000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_18                (0x00040000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_19                (0x00080000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_20                (0x00100000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_21                (0x00200000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_22                (0x00400000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_23                (0x00800000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_24                (0x01000000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_25                (0x02000000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_26                (0x04000000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_27                (0x08000000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_28                (0x10000000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_29                (0x20000000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_30                (0x40000000U << FLEXCAN_RX14MASK_RX14M_Pos)
#define  FLEXCAN_RX14MASK_RX14M_31                (0x80000000U << FLEXCAN_RX14MASK_RX14M_Pos)

/**
  * @brief FLEXCAN_RX15MASK Register Bit Definition
  */
#define  FLEXCAN_RX15MASK_RX15M_Pos               (0)
#define  FLEXCAN_RX15MASK_RX15M_Msk               (0xFFFFFFFFU << FLEXCAN_RX15MASK_RX15M_Pos)       /*!<Rx MB15 Mask Bits*/
#define  FLEXCAN_RX15MASK_RX15M                   FLEXCAN_RX15MASK_RX15M_Msk
#define  FLEXCAN_RX15MASK_RX15M_0                 (0x00000001U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_1                 (0x00000002U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_2                 (0x00000004U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_3                 (0x00000008U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_4                 (0x00000010U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_5                 (0x00000020U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_6                 (0x00000040U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_7                 (0x00000080U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_8                 (0x00000100U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_9                 (0x00000200U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_10                (0x00000400U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_11                (0x00000800U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_12                (0x00001000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_13                (0x00002000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_14                (0x00004000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_15                (0x00008000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_16                (0x00010000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_17                (0x00020000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_18                (0x00040000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_19                (0x00080000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_20                (0x00100000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_21                (0x00200000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_22                (0x00400000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_23                (0x00800000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_24                (0x01000000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_25                (0x02000000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_26                (0x04000000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_27                (0x08000000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_28                (0x10000000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_29                (0x20000000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_30                (0x40000000U << FLEXCAN_RX15MASK_RX15M_Pos)
#define  FLEXCAN_RX15MASK_RX15M_31                (0x80000000U << FLEXCAN_RX15MASK_RX15M_Pos)

/**
  * @brief FLEXCAN_ECR Register Bit Definition
  */
#define  FLEXCAN_ECR_TXERRCNT_Pos                 (0)
#define  FLEXCAN_ECR_TXERRCNT_Msk                 (0xFFU << FLEXCAN_ECR_TXERRCNT_Pos)               /*!<Transmit Error Counter �� Calculate all errors detected in transmitted messages*/
#define  FLEXCAN_ECR_TXERRCNT                     FLEXCAN_ECR_TXERRCNT_Msk
#define  FLEXCAN_ECR_TXERRCNT_0                   (0x01U << FLEXCAN_ECR_TXERRCNT_Pos)
#define  FLEXCAN_ECR_TXERRCNT_1                   (0x02U << FLEXCAN_ECR_TXERRCNT_Pos)
#define  FLEXCAN_ECR_TXERRCNT_2                   (0x04U << FLEXCAN_ECR_TXERRCNT_Pos)
#define  FLEXCAN_ECR_TXERRCNT_3                   (0x08U << FLEXCAN_ECR_TXERRCNT_Pos)
#define  FLEXCAN_ECR_TXERRCNT_4                   (0x10U << FLEXCAN_ECR_TXERRCNT_Pos)
#define  FLEXCAN_ECR_TXERRCNT_5                   (0x20U << FLEXCAN_ECR_TXERRCNT_Pos)
#define  FLEXCAN_ECR_TXERRCNT_6                   (0x40U << FLEXCAN_ECR_TXERRCNT_Pos)
#define  FLEXCAN_ECR_TXERRCNT_7                   (0x80U << FLEXCAN_ECR_TXERRCNT_Pos)
#define  FLEXCAN_ECR_RXERRCNT_Pos                 (8)
#define  FLEXCAN_ECR_RXERRCNT_Msk                 (0xFFU << FLEXCAN_ECR_RXERRCNT_Pos)               /*!<Receive Error Counter �� Calculate all errors detected in received messages*/
#define  FLEXCAN_ECR_RXERRCNT                     FLEXCAN_ECR_RXERRCNT_Msk
#define  FLEXCAN_ECR_RXERRCNT_0                   (0x01U << FLEXCAN_ECR_RXERRCNT_Pos)
#define  FLEXCAN_ECR_RXERRCNT_1                   (0x02U << FLEXCAN_ECR_RXERRCNT_Pos)
#define  FLEXCAN_ECR_RXERRCNT_2                   (0x04U << FLEXCAN_ECR_RXERRCNT_Pos)
#define  FLEXCAN_ECR_RXERRCNT_3                   (0x08U << FLEXCAN_ECR_RXERRCNT_Pos)
#define  FLEXCAN_ECR_RXERRCNT_4                   (0x10U << FLEXCAN_ECR_RXERRCNT_Pos)
#define  FLEXCAN_ECR_RXERRCNT_5                   (0x20U << FLEXCAN_ECR_RXERRCNT_Pos)
#define  FLEXCAN_ECR_RXERRCNT_6                   (0x40U << FLEXCAN_ECR_RXERRCNT_Pos)
#define  FLEXCAN_ECR_RXERRCNT_7                   (0x80U << FLEXCAN_ECR_RXERRCNT_Pos)
#define  FLEXCAN_ECR_TXERRCNTFAST_Pos             (16)
#define  FLEXCAN_ECR_TXERRCNTFAST_Msk             (0xFFU << FLEXCAN_ECR_TXERRCNTFAST_Pos)           /*!<Fast Bit Transfer Error Counter - counts all errors detected in the received CAN FD message data segment with the BRS bit set*/
#define  FLEXCAN_ECR_TXERRCNTFAST                 FLEXCAN_ECR_TXERRCNTFAST_Msk
#define  FLEXCAN_ECR_TXERRCNTFAST_0               (0x01U << FLEXCAN_ECR_TXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_TXERRCNTFAST_1               (0x02U << FLEXCAN_ECR_TXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_TXERRCNTFAST_2               (0x04U << FLEXCAN_ECR_TXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_TXERRCNTFAST_3               (0x08U << FLEXCAN_ECR_TXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_TXERRCNTFAST_4               (0x10U << FLEXCAN_ECR_TXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_TXERRCNTFAST_5               (0x20U << FLEXCAN_ECR_TXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_TXERRCNTFAST_6               (0x40U << FLEXCAN_ECR_TXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_TXERRCNTFAST_7               (0x80U << FLEXCAN_ECR_TXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_RXERRCNTFAST_Pos             (24)
#define  FLEXCAN_ECR_RXERRCNTFAST_Msk             (0xFFU << FLEXCAN_ECR_RXERRCNTFAST_Pos)           /*!<Fast Bit Receive Error Counter - counts all errors detected in the received CAN FD message data segment with the BRS bit set*/
#define  FLEXCAN_ECR_RXERRCNTFAST                 FLEXCAN_ECR_RXERRCNTFAST_Msk
#define  FLEXCAN_ECR_RXERRCNTFAST_0               (0x01U << FLEXCAN_ECR_RXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_RXERRCNTFAST_1               (0x02U << FLEXCAN_ECR_RXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_RXERRCNTFAST_2               (0x04U << FLEXCAN_ECR_RXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_RXERRCNTFAST_3               (0x08U << FLEXCAN_ECR_RXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_RXERRCNTFAST_4               (0x10U << FLEXCAN_ECR_RXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_RXERRCNTFAST_5               (0x20U << FLEXCAN_ECR_RXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_RXERRCNTFAST_6               (0x40U << FLEXCAN_ECR_RXERRCNTFAST_Pos)
#define  FLEXCAN_ECR_RXERRCNTFAST_7               (0x80U << FLEXCAN_ECR_RXERRCNTFAST_Pos)

/**
  * @brief FLEXCAN_ESR1 Register Bit Definition
  */
#define  FLEXCAN_ESR1_ERRINT_Pos                  (1)
#define  FLEXCAN_ESR1_ERRINT_Msk                  (0x1U << FLEXCAN_ESR1_ERRINT_Pos)                 /*!<Error Interrupt*/
#define  FLEXCAN_ESR1_ERRINT                      FLEXCAN_ESR1_ERRINT_Msk
#define  FLEXCAN_ESR1_BOFFINT_Pos                 (2)
#define  FLEXCAN_ESR1_BOFFINT_Msk                 (0x1U << FLEXCAN_ESR1_BOFFINT_Pos)                /*!<Bus Off Interrupt*/
#define  FLEXCAN_ESR1_BOFFINT                     FLEXCAN_ESR1_BOFFINT_Msk
#define  FLEXCAN_ESR1_RX_Pos                      (3)
#define  FLEXCAN_ESR1_RX_Msk                      (0x1U << FLEXCAN_ESR1_RX_Pos)                     /*!<1: FlexCAN is receiving a message*/
#define  FLEXCAN_ESR1_RX                          FLEXCAN_ESR1_RX_Msk
#define  FLEXCAN_ESR1_FLTCONF_Pos                 (4)
#define  FLEXCAN_ESR1_FLTCONF_Msk                 (0x3U << FLEXCAN_ESR1_FLTCONF_Pos)                /*!<*/
#define  FLEXCAN_ESR1_FLTCONF                     FLEXCAN_ESR1_FLTCONF_Msk
#define  FLEXCAN_ESR1_FLTCONF_0                   (0x1U << FLEXCAN_ESR1_FLTCONF_Pos)
#define  FLEXCAN_ESR1_FLTCONF_1                   (0x2U << FLEXCAN_ESR1_FLTCONF_Pos)
#define  FLEXCAN_ESR1_TX_Pos                      (6)
#define  FLEXCAN_ESR1_TX_Msk                      (0x1U << FLEXCAN_ESR1_TX_Pos)                     /*!<1: FlexCAN is transmitting a message*/
#define  FLEXCAN_ESR1_TX                          FLEXCAN_ESR1_TX_Msk
#define  FLEXCAN_ESR1_IDLE_Pos                    (7)
#define  FLEXCAN_ESR1_IDLE_Msk                    (0x1U << FLEXCAN_ESR1_IDLE_Pos)                   /*!<1: CAN bus is in IDLE state.*/
#define  FLEXCAN_ESR1_IDLE                        FLEXCAN_ESR1_IDLE_Msk
#define  FLEXCAN_ESR1_RXWRN_Pos                   (8)
#define  FLEXCAN_ESR1_RXWRN_Msk                   (0x1U << FLEXCAN_ESR1_RXWRN_Pos)                  /*!<Rx Error Warning �� Indicates when repetitive errors are occurring during message reception*/
#define  FLEXCAN_ESR1_RXWRN                       FLEXCAN_ESR1_RXWRN_Msk
#define  FLEXCAN_ESR1_TXWRN_Pos                   (9)
#define  FLEXCAN_ESR1_TXWRN_Msk                   (0x1U << FLEXCAN_ESR1_TXWRN_Pos)                  /*!<TX Error Warning �� Indicates when repetitive errors are occurring during message transmission*/
#define  FLEXCAN_ESR1_TXWRN                       FLEXCAN_ESR1_TXWRN_Msk
#define  FLEXCAN_ESR1_STFERR_Pos                  (10)
#define  FLEXCAN_ESR1_STFERR_Msk                  (0x1U << FLEXCAN_ESR1_STFERR_Pos)                 /*!<*/
#define  FLEXCAN_ESR1_STFERR                      FLEXCAN_ESR1_STFERR_Msk
#define  FLEXCAN_ESR1_FRMERR_Pos                  (11)
#define  FLEXCAN_ESR1_FRMERR_Msk                  (0x1U << FLEXCAN_ESR1_FRMERR_Pos)                 /*!<Form Error �� Indicates that a Form Error was detected by the receiver node (that is, a fixed-form bit field contains at least one illegal bit)*/
#define  FLEXCAN_ESR1_FRMERR                      FLEXCAN_ESR1_FRMERR_Msk
#define  FLEXCAN_ESR1_CRCERR_Pos                  (12)
#define  FLEXCAN_ESR1_CRCERR_Msk                  (0x1U << FLEXCAN_ESR1_CRCERR_Pos)                 /*!<Cyclic Redundancy Check Error �� Indicates that a CRC Error was detected by the receiver node (that is, the calculated CRC is different from the received CRC)*/
#define  FLEXCAN_ESR1_CRCERR                      FLEXCAN_ESR1_CRCERR_Msk
#define  FLEXCAN_ESR1_ACKERR_Pos                  (13)
#define  FLEXCAN_ESR1_ACKERR_Msk                  (0x1U << FLEXCAN_ESR1_ACKERR_Pos)                 /*!<Acknowledge Error �� Indicates that an Acknowledge Error was detected by the transmitter node (that is, a dominant bit wasn��t detected during the ACK SLOT)*/
#define  FLEXCAN_ESR1_ACKERR                      FLEXCAN_ESR1_ACKERR_Msk
#define  FLEXCAN_ESR1_BIT0ERR_Pos                 (14)
#define  FLEXCAN_ESR1_BIT0ERR_Msk                 (0x1U << FLEXCAN_ESR1_BIT0ERR_Pos)                /*!<Bit0 Error �� Indicates when an inconsistency occurs between the transmitted and the received bit in a message*/
#define  FLEXCAN_ESR1_BIT0ERR                     FLEXCAN_ESR1_BIT0ERR_Msk
#define  FLEXCAN_ESR1_BIT1ERR_Pos                 (15)
#define  FLEXCAN_ESR1_BIT1ERR_Msk                 (0x1U << FLEXCAN_ESR1_BIT1ERR_Pos)                /*!<Bit1 Error �� Indicates when an inconsistency occurs between the transmitted and the received bit in a message*/
#define  FLEXCAN_ESR1_BIT1ERR                     FLEXCAN_ESR1_BIT1ERR_Msk
#define  FLEXCAN_ESR1_RWRNINT_Pos                 (16)
#define  FLEXCAN_ESR1_RWRNINT_Msk                 (0x1U << FLEXCAN_ESR1_RWRNINT_Pos)                /*!<Rx Warning Interrupt Flag*/
#define  FLEXCAN_ESR1_RWRNINT                     FLEXCAN_ESR1_RWRNINT_Msk
#define  FLEXCAN_ESR1_TWRNINT_Pos                 (17)
#define  FLEXCAN_ESR1_TWRNINT_Msk                 (0x1U << FLEXCAN_ESR1_TWRNINT_Pos)                /*!<Tx Warning Interrupt Flag*/
#define  FLEXCAN_ESR1_TWRNINT                     FLEXCAN_ESR1_TWRNINT_Msk
#define  FLEXCAN_ESR1_SYNCH_Pos                   (18)
#define  FLEXCAN_ESR1_SYNCH_Msk                   (0x1U << FLEXCAN_ESR1_SYNCH_Pos)                  /*!<CAN Synchronization Status*/
#define  FLEXCAN_ESR1_SYNCH                       FLEXCAN_ESR1_SYNCH_Msk
#define  FLEXCAN_ESR1_BOFFDONEINT_Pos             (19)
#define  FLEXCAN_ESR1_BOFFDONEINT_Msk             (0x1U << FLEXCAN_ESR1_BOFFDONEINT_Pos)            /*!<Bus Off Done Interrupt*/
#define  FLEXCAN_ESR1_BOFFDONEINT                 FLEXCAN_ESR1_BOFFDONEINT_Msk
#define  FLEXCAN_ESR1_ERRINTFAST_Pos              (20)
#define  FLEXCAN_ESR1_ERRINTFAST_Msk              (0x1U << FLEXCAN_ESR1_ERRINTFAST_Pos)             /*!<Error Interrupt for Errors Detected in the data phase of CAN FD frames with the BRS bit set*/
#define  FLEXCAN_ESR1_ERRINTFAST                  FLEXCAN_ESR1_ERRINTFAST_Msk
#define  FLEXCAN_ESR1_ERROVR_Pos                  (21)
#define  FLEXCAN_ESR1_ERROVR_Msk                  (0x1U << FLEXCAN_ESR1_ERROVR_Pos)                 /*!<Error Overrun �� Indicates that an error condition occurred when any error flag is already set*/
#define  FLEXCAN_ESR1_ERROVR                      FLEXCAN_ESR1_ERROVR_Msk
#define  FLEXCAN_ESR1_STFERRFAST_Pos              (26)
#define  FLEXCAN_ESR1_STFERRFAST_Msk              (0x1U << FLEXCAN_ESR1_STFERRFAST_Pos)             /*!<Stuffing Error in the data phase of CAN FD Frames with the BRS bit set - indicates that a stuffing error has been detected in the data phase of CAN FD frames with the BRS bit set*/
#define  FLEXCAN_ESR1_STFERRFAST                  FLEXCAN_ESR1_STFERRFAST_Msk
#define  FLEXCAN_ESR1_FRMERRFAST_Pos              (27)
#define  FLEXCAN_ESR1_FRMERRFAST_Msk              (0x1U << FLEXCAN_ESR1_FRMERRFAST_Pos)             /*!<Form Error in the data phase of CAN FD Frames with the BRS bit set - indicates that a form error has been detected by the receiver node in the data phase of CAN FD frames with the BRS bit set (i.e., a fixed-form bit field contains at least one illegal bit)*/
#define  FLEXCAN_ESR1_FRMERRFAST                  FLEXCAN_ESR1_FRMERRFAST_Msk
#define  FLEXCAN_ESR1_CRCERRFAST_Pos              (28)
#define  FLEXCAN_ESR1_CRCERRFAST_Msk              (0x1U << FLEXCAN_ESR1_CRCERRFAST_Pos)             /*!<CRC check error in the CRC field of CAN FD frames with the BRS bit set - indicates that a CRC error has been detected by the receiver node in the CRC field of CAN FD frames with the BRS bit set (i.e., the calculated CRC is different from the received CRC)*/
#define  FLEXCAN_ESR1_CRCERRFAST                  FLEXCAN_ESR1_CRCERRFAST_Msk
#define  FLEXCAN_ESR1_BIT0ERRFAST_Pos             (30)
#define  FLEXCAN_ESR1_BIT0ERRFAST_Msk             (0x1U << FLEXCAN_ESR1_BIT0ERRFAST_Pos)            /*!<Bit0 Error in the data phase of CAN FD frames with the BRS bit set - indicates when an inconsistency occurs between the transmitted and the received bit in the data phase of CAN FD frames with the BRS bit set*/
#define  FLEXCAN_ESR1_BIT0ERRFAST                 FLEXCAN_ESR1_BIT0ERRFAST_Msk
#define  FLEXCAN_ESR1_BIT1ERRFAST_Pos             (31)
#define  FLEXCAN_ESR1_BIT1ERRFAST_Msk             (0x1U << FLEXCAN_ESR1_BIT1ERRFAST_Pos)            /*!<Bit1 Error in the data phase of CAN FD frames with the BRS bit set - indicates when an inconsistency occurs between the transmitted and the received bit in the data phase of CAN FD frames with the BRS bit set*/
#define  FLEXCAN_ESR1_BIT1ERRFAST                 FLEXCAN_ESR1_BIT1ERRFAST_Msk

